# Pandas - Agregacje

In [2]:
import pandas as pd

In [3]:
zmienna = 0.12345
round(zmienna, 2)
int(zmienna)

0

In [4]:
dataset = pd.read_csv('zwierzeta.csv', delimiter=',')

In [14]:
dataset

      animal  uniq_id  water_need  age
0   elephant     1001         500    5
1   elephant     1002         600    6
2   elephant     1003         550    4
3      tiger     1004         300    7
4      tiger     1005         320    8
5      tiger     1006         330    3
6      tiger     1007         290   10
7      tiger     1008         310    4
8      zebra     1009         200    5
9      zebra     1010         220   11
10     zebra     1011         240    9
11     zebra     1012         230   10
12     zebra     1013         220   15
13     zebra     1014         100   10
14     zebra     1015          80   10
15      lion     1016         420   10
16      lion     1017         600   10
17      lion     1018         500   11
18      lion     1019         390   11
19  kangaroo     1020         410   12
20  kangaroo     1021         430   11
21  kangaroo     1022         410   12

In [5]:
# Przestawienie kolumny
dataset = dataset[['uniq_id', 'animal', 'age', 'water_need']]
dataset

    uniq_id    animal  age  water_need
0      1001  elephant    5         500
1      1002  elephant    6         600
2      1003  elephant    4         550
3      1004     tiger    7         300
4      1005     tiger    8         320
5      1006     tiger    3         330
6      1007     tiger   10         290
7      1008     tiger    4         310
8      1009     zebra    5         200
9      1010     zebra   11         220
10     1011     zebra    9         240
11     1012     zebra   10         230
12     1013     zebra   15         220
13     1014     zebra   10         100
14     1015     zebra   10          80
15     1016      lion   10         420
16     1017      lion   10         600
17     1018      lion   11         500
18     1019      lion   11         390
19     1020  kangaroo   12         410
20     1021  kangaroo   11         430
21     1022  kangaroo   12         410

In [6]:
dataset.count()

uniq_id       22
animal        22
age           22
water_need    22
dtype: int64

In [7]:
dataset.animal.count()

22

In [10]:
dataset.shape

(22, 4)

In [11]:
dataset[dataset.animal == 'tiger'][['water_need', 'animal']]

   water_need animal
3         300  tiger
4         320  tiger
5         330  tiger
6         290  tiger
7         310  tiger

In [12]:
dataset[dataset.animal == 'tiger'].water_need.sum()

1550

In [13]:
dataset.min()

uniq_id           1001
animal        elephant
age                  3
water_need          80
dtype: object

In [14]:
dataset.max()

uniq_id        1022
animal        zebra
age              15
water_need      600
dtype: object

In [15]:
dataset.water_need.max()

600

In [16]:
dataset['water_need'].max()

600

In [17]:
dataset[dataset.water_need < 400].max()

uniq_id        1019
animal        zebra
age              15
water_need      390
dtype: object

In [18]:
dataset[(dataset.animal == 'tiger') & (dataset.water_need > 300)].uniq_id.max()

1008

In [19]:
dataset[dataset.animal == 'zebra'].mean()

/var/folders/gf/t0gbh7m514j9kjx2g299ch6h0000gn/T/ipykernel_62864/4000781147.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  dataset[dataset.animal == 'zebra'].mean()

uniq_id       1012.000000
age             10.000000
water_need     184.285714
dtype: float64

In [21]:
dataset[dataset['uniq_id'] > 1010].water_need.median()

AttributeError: 'list' object has no attribute 'water_need'

In [22]:
dataset.groupby('animal').uniq_id.count()

animal
elephant    3
kangaroo    3
lion        4
tiger       5
zebra       7
Name: uniq_id, dtype: int64

In [23]:
# Znaleźć nazwę zwierzęcia, które pije najwięcej wody
dataset[dataset.water_need == dataset.water_need.max()].animal

1     elephant
16        lion
Name: animal, dtype: object

In [24]:
# Podać uniq_id i ilość pitej wody dla każdego słonia lub lwa
dataset[(dataset.animal == 'lion') | (dataset.animal == 'elephant')][['water_need','animal','uniq_id']]

    water_need    animal  uniq_id
0          500  elephant     1001
1          600  elephant     1002
2          550  elephant     1003
15         420      lion     1016
16         600      lion     1017
17         500      lion     1018
18         390      lion     1019

In [24]:
# Znaleźć uniq_id dla zebry pijącej mniej niz 100 l wody
dataset[(dataset.animal == 'zebra') & (dataset.water_need < 100)].uniq_id

14    1015
Name: uniq_id, dtype: int64

In [25]:
# Ile zwierząt spożywa więcej niż 400 l wody 
dataset[dataset.water_need > 400].animal.count()

9

In [26]:
# Ile wody spożywają wszystkie zebry o uniq_id większym od 1000
dataset[(dataset.animal == 'zebra') & (dataset.uniq_id > 1000)].water_need.sum()

1290

In [27]:
# Ile wody średnio spożywa jedno zwierze
dataset.water_need.mean()

347.72727272727275

In [28]:
# Ile wody średnio spożywa jedna zebra
dataset[dataset.animal == 'zebra'].water_need.mean()

184.28571428571428

In [31]:
# Obliczyć średnią spożywaną ilość wody dla każdego gatunku zwierząt
dataset.groupby('animal').mean().water_need

animal
elephant    550.000000
kangaroo    416.666667
lion        477.500000
tiger       310.000000
zebra       184.285714
Name: water_need, dtype: float64

In [30]:
# Spośród zwierząt o uniq_id większym niż 1005, zwierzęta jakiego gatunku i w jakim wieku stanowią najliczniejszą grupę
data = dataset[dataset.uniq_id > 1005].groupby(['animal', 'age']).count().uniq_id
data[data == data.max()]
data.idxmax() #index dla największego elementu

('zebra', 10)

In [31]:
# Ile jest zwierząt każdego gatunku
dataset.groupby('animal').count().uniq_id

animal
elephant    3
kangaroo    3
lion        4
tiger       5
zebra       7
Name: uniq_id, dtype: int64

In [32]:
# Zebr o jakim wieku, jest najwięcej
dane = dataset[dataset.animal == 'zebra'].groupby('age').count().uniq_id
print(dane[dane == dane.max()])
print(dane.idxmax())

age
10    3
Name: uniq_id, dtype: int64
10

# Pandas - Tabele

In [33]:
import numpy as np
import pandas as pd

In [39]:
# Uzupełnianie pustych wartości
df = pd.DataFrame([{'a': 0, 'b': 1}, {'a': 2, 'c': 3}, {'a': 4, 'c': 5}])
df

   a    b    c
0  0  1.0  NaN
1  2  NaN  3.0
2  4  NaN  5.0

In [35]:
df.loc[1, 'b'] = 7

In [36]:
df

   a    b    c
0  0  1.0  NaN
1  2  7.0  3.0
2  4  NaN  5.0

In [37]:
#df.dropna(#kolumna,wiersz) - usuwanie danych NaN
df.fillna(5)

   a    b    c
0  0  1.0  5.0
1  2  7.0  3.0
2  4  5.0  5.0

In [40]:
df.fillna(method='bfill', axis=0)

   a    b    c
0  0  1.0  3.0
1  2  NaN  3.0
2  4  NaN  5.0

In [41]:
df.loc[1, 'b'] = np.nan

In [42]:
df.fillna({'b': 10})

   a     b    c
0  0   1.0  NaN
1  2  10.0  3.0
2  4  10.0  5.0

In [43]:
df.fillna({'b': 10}, limit=1)

   a     b    c
0  0   1.0  NaN
1  2  10.0  3.0
2  4   NaN  5.0

In [44]:
df['c'].fillna(df['c'].mean(), limit=1, inplace=True)
df

   a    b    c
0  0  1.0  4.0
1  2  NaN  3.0
2  4  NaN  5.0

In [45]:
np.random.randn(5, 3)

array([[-0.75368605, -0.01254131, -2.39757977],
       [ 0.56826821,  0.02729672,  0.08048428],
       [ 0.90967449,  1.44709445,  0.66949181],
       [ 0.47472483, -0.59402275,  0.19048281],
       [ 0.34886568, -0.10266924,  0.43130363]])

In [46]:
df = pd.DataFrame(np.random.randn(5, 3), columns=['col1','col2','col3'])
df

       col1      col2      col3
0  0.989132 -0.685895  0.027489
1 -1.735647 -1.105453  0.561904
2  0.382052 -0.232294 -1.142403
3 -2.481687 -1.459304  0.256589
4  0.702324  0.512725 -0.795998

In [47]:
# Transponowanie
df.T

             0         1         2         3         4
col1  0.989132 -1.735647  0.382052 -2.481687  0.702324
col2 -0.685895 -1.105453 -0.232294 -1.459304  0.512725
col3  0.027489  0.561904 -1.142403  0.256589 -0.795998

In [48]:
# Dodanie kolumny
df['col4'] = ['wartosc 4', 'wartosc 2', 'w1', 'w3', 'w5']
df

       col1      col2      col3       col4
0  0.989132 -0.685895  0.027489  wartosc 4
1 -1.735647 -1.105453  0.561904  wartosc 2
2  0.382052 -0.232294 -1.142403         w1
3 -2.481687 -1.459304  0.256589         w3
4  0.702324  0.512725 -0.795998         w5

In [49]:
# Dodanie kolumny w żądanym miejscu
df.insert(1, 'col6', ['a', 'b', 'c', 'd', 'e'])
df

       col1 col6      col2      col3       col4
0  0.989132    a -0.685895  0.027489  wartosc 4
1 -1.735647    b -1.105453  0.561904  wartosc 2
2  0.382052    c -0.232294 -1.142403         w1
3 -2.481687    d -1.459304  0.256589         w3
4  0.702324    e  0.512725 -0.795998         w5

In [57]:
df['sum'], df['diff'] = df['col1'] + df['col2'], df['col1'] - df['col2']
df

       col1 col6      col2      col3       col4       sum      diff
0  0.989132    a -0.685895  0.027489  wartosc 4  0.303237  1.675027
1 -1.735647    b -1.105453  0.561904  wartosc 2 -2.841100 -0.630195
2  0.382052    c -0.232294 -1.142403         w1  0.149759  0.614346
3 -2.481687    d -1.459304  0.256589         w3 -3.940991 -1.022384
4  0.702324    e  0.512725 -0.795998         w5  1.215048  0.189599

In [58]:
# Usunięcie kolumny
removed = df.pop('diff')
print(df)
print('\n')
print(removed)

       col1 col6      col2      col3       col4       sum
0  0.989132    a -0.685895  0.027489  wartosc 4  0.303237
1 -1.735647    b -1.105453  0.561904  wartosc 2 -2.841100
2  0.382052    c -0.232294 -1.142403         w1  0.149759
3 -2.481687    d -1.459304  0.256589         w3 -3.940991
4  0.702324    e  0.512725 -0.795998         w5  1.215048


0    1.675027
1   -0.630195
2    0.614346
3   -1.022384
4    0.189599
Name: diff, dtype: float64

In [59]:
df.drop('sum', axis=1)
df

       col1 col6      col2      col3       col4       sum
0  0.989132    a -0.685895  0.027489  wartosc 4  0.303237
1 -1.735647    b -1.105453  0.561904  wartosc 2 -2.841100
2  0.382052    c -0.232294 -1.142403         w1  0.149759
3 -2.481687    d -1.459304  0.256589         w3 -3.940991
4  0.702324    e  0.512725 -0.795998         w5  1.215048

In [60]:
df = df.drop('sum', axis=1)
df

       col1 col6      col2      col3       col4
0  0.989132    a -0.685895  0.027489  wartosc 4
1 -1.735647    b -1.105453  0.561904  wartosc 2
2  0.382052    c -0.232294 -1.142403         w1
3 -2.481687    d -1.459304  0.256589         w3
4  0.702324    e  0.512725 -0.795998         w5

In [61]:
df.drop('col4', axis=1, inplace=True)
df

       col1 col6      col2      col3
0  0.989132    a -0.685895  0.027489
1 -1.735647    b -1.105453  0.561904
2  0.382052    c -0.232294 -1.142403
3 -2.481687    d -1.459304  0.256589
4  0.702324    e  0.512725 -0.795998

In [62]:
df.loc[2] #wyświetla wiersz 2
df.loc[2:4] #wyświetla wiersze 2,3,4

       col1 col6      col2      col3
2  0.382052    c -0.232294 -1.142403
3 -2.481687    d -1.459304  0.256589
4  0.702324    e  0.512725 -0.795998

In [63]:
# Dodanie wiersza
print(df)
print('\n')
df.loc[2] = ['a', 'b', 'c', 'd'] #zamiana wartości
print(df)

       col1 col6      col2      col3
0  0.989132    a -0.685895  0.027489
1 -1.735647    b -1.105453  0.561904
2  0.382052    c -0.232294 -1.142403
3 -2.481687    d -1.459304  0.256589
4  0.702324    e  0.512725 -0.795998


       col1 col6      col2      col3
0  0.989132    a -0.685895  0.027489
1 -1.735647    b -1.105453  0.561904
2         a    b         c         d
3 -2.481687    d -1.459304  0.256589
4  0.702324    e  0.512725 -0.795998

In [65]:
df.append({'col1': 0, 'col2': 1, 'col3': 2, 'col5': 'f'}, ignore_index=True)

       col1 col6      col2      col3 col5
0  0.989132    a -0.685895  0.027489  NaN
1 -1.735647    b -1.105453  0.561904  NaN
2         a    b         c         d  NaN
3 -2.481687    d -1.459304  0.256589  NaN
4  0.702324    e  0.512725 -0.795998  NaN
5         0  NaN         1         2    f

In [66]:
df = df[['col1', 'col2', 'col3']]
df

       col1      col2      col3
0  0.989132 -0.685895  0.027489
1 -1.735647 -1.105453  0.561904
2         a         c         d
3 -2.481687 -1.459304  0.256589
4  0.702324  0.512725 -0.795998

In [67]:
# Usuwanie wiersza
df = df.drop(2)
df

       col1      col2      col3
0  0.989132 -0.685895  0.027489
1 -1.735647 -1.105453  0.561904
3 -2.481687 -1.459304  0.256589
4  0.702324  0.512725 -0.795998

In [68]:
df.drop(df.index[0:2], inplace=True)
df

       col1      col2      col3
3 -2.481687 -1.459304  0.256589
4  0.702324  0.512725 -0.795998

In [69]:
# Wywoływanie własnej lub zewnętrznej funkcji na tabelach
# 1. Na poziomie tabeli: metoda pipe()

In [70]:
def adder(element1, element2):
    return element1 + element2

In [72]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0 -1.455376  1.104884  0.431684
1 -0.250054 -1.785450 -0.563175
2  0.511196 -0.593369 -0.962626
3 -0.094959 -0.335797 -1.462500
4  1.348363  0.549359  1.094245

In [77]:
df.pipe(adder, 2) #wywołanie funkcji dla każdego rekordu tabeli -> adder(rekord, 2) x 15 razy

       col1      col2      col3
0  0.544624  3.104884  2.431684
1  1.749946  0.214550  1.436825
2  2.511196  1.406631  1.037374
3  1.905041  1.664203  0.537500
4  3.348363  2.549359  3.094245

In [79]:
def multiplier(element1, element2):
    return element1 * element2

In [80]:
print('Oryginalna tabela')
print(df)

print('\nKazdy element + 2')
print(df.pipe(adder, 2))

print('\nKazdy element * 2')
print(df.pipe(multiplier, 2))

Oryginalna tabela
       col1      col2      col3
0 -1.455376  1.104884  0.431684
1 -0.250054 -1.785450 -0.563175
2  0.511196 -0.593369 -0.962626
3 -0.094959 -0.335797 -1.462500
4  1.348363  0.549359  1.094245

Kazdy element + 2
       col1      col2      col3
0  0.544624  3.104884  2.431684
1  1.749946  0.214550  1.436825
2  2.511196  1.406631  1.037374
3  1.905041  1.664203  0.537500
4  3.348363  2.549359  3.094245

Kazdy element * 2
       col1      col2      col3
0 -2.910752  2.209769  0.863368
1 -0.500108 -3.570900 -1.126351
2  1.022393 -1.186738 -1.925253
3 -0.189918 -0.671594 -2.925000
4  2.696725  1.098718  2.188489

In [81]:
df.pipe(np.mean)

col1    0.011834
col2   -0.212074
col3   -0.292475
dtype: float64

In [82]:
df.pipe(np.mean, axis=1)

0    0.027064
1   -0.866226
2   -0.348266
3   -0.631085
4    0.997322
dtype: float64

In [83]:
np.mean(df, axis=1)

0    0.027064
1   -0.866226
2   -0.348266
3   -0.631085
4    0.997322
dtype: float64

In [84]:
# 2. Na poziomie wiersza lub kolumny: metoda apply()

In [93]:
print(df)
df.apply(np.mean)

       col1      col2      col3
0 -1.455376  1.104884  0.431684
1 -0.250054 -1.785450 -0.563175
2  0.511196 -0.593369 -0.962626
3 -0.094959 -0.335797 -1.462500
4  1.348363  0.549359  1.094245

col1    0.011834
col2   -0.212074
col3   -0.292475
dtype: float64

In [96]:
#def nazwa_funkcji(argumenty):
# ciało_funkcji (zwracane argumenty)

#lambda argumenty: instrukcje
#moja_funkcja = lambda x: x * 2

df.apply(lambda x: x.max() - x.min()) #działanie na kolumnach/wierszach
df.col1.apply(lambda x: x + 5) #działanie na komórkach

0    3.544624
1    4.749946
2    5.511196
3    4.905041
4    6.348363
Name: col1, dtype: float64

In [71]:
# 3. Na poziomie pojedynczej komórki: metody applymap(), map()

In [98]:
print(df)
df.applymap(lambda x: x + 5)

       col1      col2      col3
0 -1.455376  1.104884  0.431684
1 -0.250054 -1.785450 -0.563175
2  0.511196 -0.593369 -0.962626
3 -0.094959 -0.335797 -1.462500
4  1.348363  0.549359  1.094245

       col1      col2      col3
0  3.544624  6.104884  5.431684
1  4.749946  3.214550  4.436825
2  5.511196  4.406631  4.037374
3  4.905041  4.664203  3.537500
4  6.348363  5.549359  6.094245

In [99]:
df['col4'] = df['col1'].map(lambda x: x + 5) - df['col2'] * 2
df

       col1      col2      col3      col4
0 -1.455376  1.104884  0.431684  1.334855
1 -0.250054 -1.785450 -0.563175  8.320846
2  0.511196 -0.593369 -0.962626  6.697934
3 -0.094959 -0.335797 -1.462500  5.576635
4  1.348363  0.549359  1.094245  5.249644

In [5]:
# Sortowanie - po nazwach / indeksach lub wartościach

In [100]:
# Sortowanie według nazw wierszy
unsorted_df = pd.DataFrame(
    np.random.randn(10, 2), index=[1, 4, 6, 2, 3, 5, 9, 8, 0, 7], columns = ['col2', 'col1'])
print(unsorted_df)
print('\n')

sorted_df = unsorted_df.sort_index()
print(sorted_df)

       col2      col1
1 -1.015423  2.008810
4 -0.002855  0.167466
6 -1.232140 -0.189760
2  0.308592  0.931929
3 -0.505649 -1.520990
5  0.239159 -2.179854
9  0.138605  0.077048
8  1.518488 -0.972295
0  1.006271  1.314717
7 -1.005804  0.476871


       col2      col1
0  1.006271  1.314717
1 -1.015423  2.008810
2  0.308592  0.931929
3 -0.505649 -1.520990
4 -0.002855  0.167466
5  0.239159 -2.179854
6 -1.232140 -0.189760
7 -1.005804  0.476871
8  1.518488 -0.972295
9  0.138605  0.077048

In [101]:
sorted_df = unsorted_df.sort_index(ascending=False)
print(sorted_df)

       col2      col1
9  0.138605  0.077048
8  1.518488 -0.972295
7 -1.005804  0.476871
6 -1.232140 -0.189760
5  0.239159 -2.179854
4 -0.002855  0.167466
3 -0.505649 -1.520990
2  0.308592  0.931929
1 -1.015423  2.008810
0  1.006271  1.314717

In [102]:
# Sortowanie według nazw kolumn
 
sorted_df = unsorted_df.sort_index(axis=1)
print(sorted_df)

       col1      col2
1  2.008810 -1.015423
4  0.167466 -0.002855
6 -0.189760 -1.232140
2  0.931929  0.308592
3 -1.520990 -0.505649
5 -2.179854  0.239159
9  0.077048  0.138605
8 -0.972295  1.518488
0  1.314717  1.006271
7  0.476871 -1.005804

In [103]:
sorted_df = unsorted_df.sort_index(axis=1).sort_index(ascending=False)
print(sorted_df)

       col1      col2
9  0.077048  0.138605
8 -0.972295  1.518488
7  0.476871 -1.005804
6 -0.189760 -1.232140
5 -2.179854  0.239159
4  0.167466 -0.002855
3 -1.520990 -0.505649
2  0.931929  0.308592
1  2.008810 -1.015423
0  1.314717  1.006271

In [108]:
# Sortowanie po wartościach
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1', ascending=True)
print(unsorted_df)
print('\n')
print(sorted_df)

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4


   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

In [82]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by=['col1', 'col2'])
print(unsorted_df)
print('\n')
print(sorted_df)

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4


   col1  col2
2     1     2
1     1     3
3     1     4
0     2     1

In [107]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1', kind='mergesort')
print(unsorted_df)
print('\n')
print(sorted_df)

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4


   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

In [106]:
d1 = pd.DataFrame(
    {
        'id':[1,2,3,4,5],
        'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
        'subject_id':['sub1','sub2','sub4','sub6','sub5']
    }
)
d2 = pd.DataFrame(
    {
        'id':[1,2,3,4,5],
        'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
        'subject_id':['sub2','sub4','sub3','sub6','sub5']
    }
)
print(d1)
print('\n') #nowa_linia
print(d2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [109]:
pd.merge(d1, d2, on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [110]:
pd.merge(d1, d2, on=['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [111]:
print(d1)
print('\n')
print(d2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [88]:
pd.merge(d1, d2, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

In [89]:
pd.merge(d1, d2, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   4.0   Alice       sub6     4  Bryce
3   5.0  Ayoung       sub5     5  Betty
4   NaN     NaN       sub3     3   Bran

In [112]:
print(d1)
print('\n')
print(d2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [113]:
pd.merge(d1, d2, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

In [114]:
pd.merge(d1, d2, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

In [117]:
# Obiekty rzadkie
ts = pd.Series(np.random.randn(10))
ts[2:-2] = np.nan
print(ts)

0   -1.452557
1    0.008283
2         NaN
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
8    0.608075
9    1.503716
dtype: float64

In [118]:
ts.to_dense()

AttributeError: 'Series' object has no attribute 'to_dense'

In [123]:
df = pd.DataFrame(np.random.randn(10000, 4))
df.loc[:9998] = np.nan
sdf = df.to_sparse()
sdf

AttributeError: 'DataFrame' object has no attribute 'to_sparse'

In [122]:
sdf.to_dense()

NameError: name 'sdf' is not defined

In [124]:
df1 = pd.DataFrame([[0, 1, 2, 20], [3, 4, 5, 21], [6, 7, 8, 22], [9, 10, 11, 23]])
df2 = df1 * -1
print(df1)
print('\n')
print(df2)

   0   1   2   3
0  0   1   2  20
1  3   4   5  21
2  6   7   8  22
3  9  10  11  23


   0   1   2   3
0  0  -1  -2 -20
1 -3  -4  -5 -21
2 -6  -7  -8 -22
3 -9 -10 -11 -23

In [125]:
# Dla każdego wiersza tabeli dodać maksymalną wartość z kolumny o tym samym indeksie co ten wiersz,
# ale pochodzącej z drugiej tabeli
n = -1
def get_max(row):
    global n
    n = n + 1
    if n == 0:
        return row
    element = df2[df2.columns[n - 1]].max()
    return row + element

print(df1)
print('\n')
print(df2)
df1.apply(get_max, axis=1)

   0   1   2   3
0  0   1   2  20
1  3   4   5  21
2  6   7   8  22
3  9  10  11  23


   0   1   2   3
0  0  -1  -2 -20
1 -3  -4  -5 -21
2 -6  -7  -8 -22
3 -9 -10 -11 -23

   0  1  2   3
0  0  1  2  20
1  3  4  5  21
2  5  6  7  21
3  7  8  9  21

In [126]:
my_dict = {}

def dodaj_wartosc(imie, wzrost):
    global my_dict
    my_dict[imie] = wzrost

In [58]:
# Do 1-szego wiersza macerzy dodać 1, do 2-go 2, itd.
n = -1
def get_max(row):
    global n
    n += 1
    if n == 0:
        return row
    element = n
    return row + element

print(df1)
print('\n')
print(df2)
df1.apply(get_max, axis=1)

   0   1   2   3
0  0   1   2  20
1  3   4   5  21
2  6   7   8  22
3  9  10  11  23


   0   1   2   3
0  0  -1  -2 -20
1 -3  -4  -5 -21
2 -6  -7  -8 -22
3 -9 -10 -11 -23

    0   1   2   3
0   1   2   3  21
1   5   6   7  23
2   9  10  11  25
3  13  14  15  27

In [59]:
# Napisać funkcję do transponowania macierzy
def transpose(matrix):
    result = pd.DataFrame(index=matrix.columns, columns=matrix.index)
    for i, column in enumerate(matrix):
        result.loc[i] = matrix[column]
    return result

print(df1)
print('\n')
print(transpose(df1))

   0   1   2   3
0  0   1   2  20
1  3   4   5  21
2  6   7   8  22
3  9  10  11  23


    0   1   2   3
0   0   3   6   9
1   1   4   7  10
2   2   5   8  11
3  20  21  22  23

In [127]:
df1 = pd.DataFrame([{'a': 0, 'b': 1}, {'a': 2, 'c': 3}, {'a': 4, 'c': 5}])
df2 = pd.DataFrame([{'a': 6, 'b': 7}, {'a': 8, 'b': 9}, {'a': 10, 'c': 10}])

In [128]:
df1

   a    b    c
0  0  1.0  NaN
1  2  NaN  3.0
2  4  NaN  5.0

In [129]:
df2

    a    b     c
0   6  7.0   NaN
1   8  9.0   NaN
2  10  NaN  10.0

In [100]:
# Uzupełnić puste wartości dla 'b' w df1 wstawiając średnią z 'b' obliczoną dla df2
df1['b'].fillna(df2['b'].mean())

0    1.0
1    8.0
2    8.0
Name: b, dtype: float64

In [101]:
# Uzupełnić puste wartości dla 'c' w df2 wstawiając średnią różnicę pomiędzy z 'a' i 'b' obliczoną dla df1
df1['b'].fillna((df2['a'] - df2['b']).mean())

0    1.0
1   -1.0
2   -1.0
Name: b, dtype: float64

# Pandas - Statystyka

In [130]:
import numpy as np
import pandas as pd

In [131]:
# Procent przyrostu danych
s = pd.Series([1,2,3,4,5,4])
s

0    1
1    2
2    3
3    4
4    5
5    4
dtype: int64

In [132]:
print(s.pct_change())

0         NaN
1    1.000000
2    0.500000
3    0.333333
4    0.250000
5   -0.200000
dtype: float64

In [133]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [134]:
df.pct_change()

     0    1    2
0  NaN  NaN  NaN
1  3.0  1.5  1.0

In [135]:
df.pct_change(axis=1)

    0     1    2
0 NaN  1.00  0.5
1 NaN  0.25  0.2

In [136]:
# Kowariancja
s1 = pd.Series(np.random.randn(10))
s2 = pd.Series(np.random.randn(10))
print(s1)
print('\n')
print(s2)

0    0.495890
1   -1.694522
2    1.014311
3   -0.452164
4   -0.847925
5    0.894171
6   -0.800984
7    1.381314
8    0.148760
9   -1.862343
dtype: float64


0   -0.302449
1   -0.863917
2    0.317757
3   -0.313143
4    0.172684
5    0.198771
6    0.000083
7    0.111204
8   -0.540425
9   -0.868418
dtype: float64

In [137]:
s1.cov(s2) #korelacja <-1, 1>

0.34886132457370955

In [138]:
frame = pd.DataFrame([[1, -2, 3], [-4, 5, -6]], columns=['a', 'b', 'c'])
frame

   a  b  c
0  1 -2  3
1 -4  5 -6

In [139]:
frame.cov()

      a     b     c
a  12.5 -17.5  22.5
b -17.5  24.5 -31.5
c  22.5 -31.5  40.5

In [140]:
frame['a'].cov(frame['b'])

-17.5

In [141]:
# Korelacja
frame = pd.DataFrame(np.random.randn(10, 5), columns=['a', 'b', 'c', 'd', 'e'])
frame

          a         b         c         d         e
0 -0.706079 -0.893941  0.311303  1.141761  0.085742
1  0.041648 -0.580110  0.352179  1.030542 -0.502318
2  0.612189 -0.038260 -0.916436 -1.257597  1.126122
3  0.172032  0.453368  0.062107 -0.134548 -0.978144
4  0.408504  1.871999  1.988062  0.591295 -0.116841
5 -0.439863  0.521790 -1.999533 -0.179727 -1.752831
6 -0.080648  0.280555  0.887263 -0.350706 -0.281402
7 -0.478917  0.207984  0.634389  0.397565 -1.792914
8 -1.057644 -1.321148 -0.343477 -0.413364  0.859523
9 -0.083546 -1.437381 -0.888825 -0.364482 -0.763917

In [142]:
frame['a'].corr(frame['b']) #zależność jest gdy <-0,7 | >0,7

0.5299864648086301

In [143]:
frame.corr(method='spearman')

          a         b         c         d         e
a  1.000000  0.466667  0.115152 -0.090909  0.139394
b  0.466667  1.000000  0.296970  0.224242 -0.321212
c  0.115152  0.296970  1.000000  0.563636 -0.030303
d -0.090909  0.224242  0.563636  1.000000 -0.272727
e  0.139394 -0.321212 -0.030303 -0.272727  1.000000

In [146]:
# Ranking
s = pd.Series(np.random.randn(5), index=list('abcde'))
s['d'] = s['b']
s

a    0.067977
b   -2.396656
c   -0.694281
d   -2.396656
e    0.014446
dtype: float64

In [147]:
s.rank()

a    5.0
b    1.5
c    3.0
d    1.5
e    4.0
dtype: float64

In [148]:
s.rank(method='first')

a    5.0
b    1.0
c    3.0
d    2.0
e    4.0
dtype: float64

In [150]:
# Statystyki
d = {
    'Name': pd.Series(
        ['Tom','James','Ricky','Vin','Steve','Smith','Jack', 'Lee','David','Gasper','Betina','Andres']),
    'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
    'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

df = pd.DataFrame(d)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [151]:
df.sum()

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [152]:
df.sum(axis=1)

/var/folders/gf/t0gbh7m514j9kjx2g299ch6h0000gn/T/ipykernel_62864/1459321664.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [153]:
df.mean()

/var/folders/gf/t0gbh7m514j9kjx2g299ch6h0000gn/T/ipykernel_62864/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age       31.833333
Rating     3.743333
dtype: float64

In [154]:
df.std() #odchylenie standardowe

/var/folders/gf/t0gbh7m514j9kjx2g299ch6h0000gn/T/ipykernel_62864/1434575935.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std() #odchylenie standardowe

Age       9.232682
Rating    0.661628
dtype: float64

In [155]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [156]:
df.describe(include=['object']) # object dla typu słownego, number dla typu numerycznego, all dla wszystkich

       Name
count    12
unique   12
top     Tom
freq      1

In [157]:
df.describe(include='all')

       Name        Age     Rating
count    12  12.000000  12.000000
unique   12        NaN        NaN
top     Tom        NaN        NaN
freq      1        NaN        NaN
mean    NaN  31.833333   3.743333
std     NaN   9.232682   0.661628
min     NaN  23.000000   2.560000
25%     NaN  25.000000   3.230000
50%     NaN  29.500000   3.790000
75%     NaN  35.500000   4.132500
max     NaN  51.000000   4.800000

In [159]:
# Okno czasowe
df = pd.DataFrame(np.random.randn(10, 4), index = pd.date_range('21/10/2021', periods=10),columns = ['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2021-10-21 -0.503047 -0.132653  0.188857  0.316190
2021-10-22 -2.562665  1.276692 -0.281679 -0.376452
2021-10-23  0.922032  0.050355 -0.309643  0.430623
2021-10-24  1.205198 -0.000080 -2.422966 -0.053436
2021-10-25  0.768931  0.767268  2.094181  0.484731
2021-10-26 -0.690537 -1.611199  0.780331 -0.587955
2021-10-27  0.516332 -0.114793 -1.245643 -0.269653
2021-10-28  0.467723 -0.412509 -1.563525  0.298565
2021-10-29  1.616885  0.051413 -0.592535  0.043022
2021-10-30 -0.666982 -0.825948  1.330232  0.354975

In [160]:
df.rolling(window=2).mean()

                   A         B         C         D
2021-10-21       NaN       NaN       NaN       NaN
2021-10-22 -1.532856  0.572019 -0.046411 -0.030131
2021-10-23 -0.820317  0.663523 -0.295661  0.027086
2021-10-24  1.063615  0.025138 -1.366305  0.188594
2021-10-25  0.987065  0.383594 -0.164392  0.215647
2021-10-26  0.039197 -0.421966  1.437256 -0.051612
2021-10-27 -0.087102 -0.862996 -0.232656 -0.428804
2021-10-28  0.492028 -0.263651 -1.404584  0.014456
2021-10-29  1.042304 -0.180548 -1.078030  0.170794
2021-10-30  0.474951 -0.387268  0.368848  0.198998

In [161]:
df.expanding(min_periods=3).mean()

                   A         B         C         D
2021-10-21       NaN       NaN       NaN       NaN
2021-10-22       NaN       NaN       NaN       NaN
2021-10-23 -0.714560  0.398131 -0.134155  0.123454
2021-10-24 -0.234621  0.298578 -0.706358  0.079232
2021-10-25 -0.033910  0.392316 -0.146250  0.160331
2021-10-26 -0.143348  0.058397  0.008180  0.035617
2021-10-27 -0.049108  0.033656 -0.170937 -0.007993
2021-10-28  0.015496 -0.022115 -0.345011  0.030327
2021-10-29  0.193428 -0.013945 -0.372514  0.031737
2021-10-30  0.107387 -0.095145 -0.202239  0.064061